Repository: common-repository/professional-payment-portal-for-woocommerce
Catalog: translations/ppp-for-woo-*.po
Languages: nl

source: Professional Payment Portal - Merchant settings
nl: Professional Payment Portal - Merchant instellingen

source: IMPORTANT: To process transactions properly, please configure your payment configuration for this shop on the
nl: BELANGRIJK: Om transacties correct te verwerken, voer uw betaal configuratie voor dit verkooppunt op in het

source: The API Key can be found on the Professional Payment Portal dashboard.
nl: De API Key kan gevonden worden op het Professional Payment Portal dashboard.

source: Enable this method to receive transactions with PPP - %s
nl: Zet deze methode aan om betalingen te ontvangen via PPP - %s

source: Enable/Disable
nl: Ingeschakeld/Uitgeschakeld

source: Enable PPP
nl: Schakel PPP in

source: Title
nl: Titel

source: This controls the title which the user sees during checkout.
nl: Dit bepaald welke titel de klant ziet tijdens het afrekenen.

source: Customer Message after payment select
nl: Klant bericht na betaalmethode selectie

source: iDEAL 2.0 payment started with:
nl: iDEAL 2.0 betaling gestart met:

source: Using Payment Job:
nl: Met Payment Job:

source: PPP returned an error! Message:
nl: PPP gaf een foutmelding! Bericht:

source: Professional Payment Portal returned an error! No Token could be generated based on the API key.
nl: Professional Payment Portal gaf een foutmelding! Geen accesstoken kon worden gegenereerd met deze API key.

source: Status received from Customer Return:
nl: Status ontvangen met klant terugkomst:

source: Order updated, check PPP dashboard for status before sending products
nl: Bestelling bijgewerkt, controleer het PPP-dashboard voor de status voordat u producten verzendt

source: Payment-method:
nl: Betaalmethode:

source: Payment status already received: Order status not updated, check PPP dashboard for status
nl: Betaalstatus al ontvangen: Bestelling niet geupdatet, controleer PPP dashboard voor status

source: Order not updated, check PPP dashboard for status
nl: Bestelling niet bijgewerkt, controleer het PPP-dashboard voor de status

source: Status received from PPP Webhook:
nl: Status ontvangen van PPP Webhook:

source: for Payment job:
nl: met Payment job:

source: Update order status: Payment Completed
nl: Order status geupdatet: Betaling geslaagd

source: Order status not updated: Payment status already received
nl: Bestelstatus niet bijgewerkt: betalingsstatus al ontvangen

source: Payment is cancelled or expired, but will be cancelled automaticly by WooCommerce.
nl: Betaling is geannuleerd of verlopen, maar word automatisch door Wocommerce geannuleerd.

source: Update order status: Failed.
nl: Bestelstatus update: Mislukt.

source: Update order status: Cancelled.
nl: Bestelstatus bijwerken: Geannuleerd.

source: No Final status has been found.
nl: Geen eind status gevonden.

source: Payment Job updated.
nl: Payment Job geupdatet.

source: Order doesnt have the correct status to be changed by the payment method.
nl: Bestelling heeft niet de juiste status om aangepast te worden door de betaalmethode.

source: Enable the use of UserTokens to allow customers to pay faster
nl: Zet Usertokens aan voor versneld betalen voor klanten

source: Pay quicker with iDEAL Fast Checkout
nl: Bestel sneller met iDEAL Fast Checkout

source: Oops !
nl: Oeps !

source: Page Not Found
nl: Pagina niet gevonden

source: Back
nl: Terug

source: Your Cart is Empty
nl: Uw winkelwagen is leeg

source: No shipping method has been selected.
nl: Geen verzendmethode geselecteerd.

source: Professional Payment Portal returned an error! Please try again or use another payment method.
nl: Professional Payment Portal gaf een foutmelding terug! Probeer het later nogmaals, of met een andere betaalmethode.

source: View WooCommerce settings
nl: Bekijk WooCommerce instellingen

source: Settings
nl: Instellingen
